//Copyright © 2017 (´･@･)
//[License]GNU Affero General Public License, version 3
//[Contact]http://tacoika.blog87.fc2.com/
#pragma once
//#include "../system/enum_type.h"
namespace SDX_BSC
{
	using namespace SDX;

	/**/
	class
	{
	private:

	public:
		//店タイプ
		//店色、店名
		//工房人数
		//従業員リスト
		//資金
		//ブラック度
		//店舗営業時間
		//研究レベル[装備種]
		//研究経験値[装備種]

		//装備在庫
		//装備開発状況
		//装備開発日数
		//装備改良レベル、改良ステータスなど
		//装備製造目標数

		//セール期間、セール率、セール効果
		//部門別経営戦略レベル
		//経営戦略経験値

		//累計採用数
		//平均勤続日数

		//従業員平均レベル
		//平均給与
		//平均勤続日数
		//ブラッド度固定補正

		//休日数
		//定休日
		//始業時刻
		//終業時刻
		//残業時間

		//残り工事日数

		//倉庫現在数
		//倉庫最大数

		//素材数、素材仕入れ数

		//現在来客合計数
		//来客一覧

		//現在マネジメントポイント
		//毎日MP回復量

		//経営戦術
		//状態
		//消費MP
		//残使用回数
		//使用回数
		//閃いてからの日数(new表示用)

		//知名度、店評価

		//各種経営戦術ボーナス補正
		//戦術MP、資金補正
		//製造、改良、疲労、接客、開発、やる気、要求補正
		//病気補正、クレーマー率、経験値補正、疲労回復補正
		//給料補正、退職率補正、社畜度補正
		//税金補正、利息補正、仕入れ補正
		//知名度補正、研究補正、宣伝補正
		//装備性能補正
		//ステータス成長補正

		/*レコード、統計関係*/
		//合計来客数
		//装備種別来客数
		//日別販売数、売り上げ、客数、装備種別売上、製造数、仕入れ費用、装備種別シェア
		//月別↑＋人件費、経営戦術費用、税金利子、利益、総資産、装備種別シェア
		//
	};
}