//Copyright © 2019 (´･@･)
//[License]GNU Affero General Public License, version 3
//[Contact]http://tacoika.blog87.fc2.com/
#pragma once
;
namespace SDX_ADE
{
	using namespace SDX;

	//難易度
	enum class GameType
	{
		ノーマル,
		ハード,
		デスマーチ,
		COUNT
	};

	//◆Aスキル
	//スキル対象
	enum class ASkillTarget
	{
		自分,
		隣接,
		前列,
		後列,
		弱者,
		前列範囲,
		後列範囲,
		敵前列,
		敵後列,
		敵弱者,
		敵前列範囲,
		敵後列範囲,
		COUNT
	};

	//スキルタグ
	enum class ASkillType
	{
		//基本タグ
		なし,
		攻撃,
		回復,
		シールド,
		補助,
		異常,
		バフ,
		デバフ,
		//範囲
		自分,
		単体,
		範囲,
		全体,
		乱打,
		多段,
		暗殺,
		出血,
		毒,
		スタン,
		COUNT
	};

	//バフ・デバフ・特殊状態効果
	enum class BuffType
	{
		なし,
		＠バフ・デバフ,
		与ダメ増減,//割合増減
		被ダメ増減,//割合増減
		パワー,//+数値
		防御,
		命中,//+数値
		回避,//+数値
		マーク,//ターゲットになる
		シールド,//ターゲットから外れる
		再生,//CT速度割合増減

		//デメリットのみのやつ
		＠状態異常,
		出血,//行動時ダメージ
		猛毒,//一定時間毎にダメージ
		スタン,//一定値CTが減少
		COUNT
	};

	//追加効果
	enum class ASkillSubType
	{
		//実質bool値
		なし,
		必中,
		マーク無視,
		//エディタ上は-100～100の整数、ゲーム上は-1.0～1.0のdouble
		防御貫通,//1で完全無視
		回避貫通,
		超過回復,//最大HPを超えた分バリアを貼る
		吸収,//1で与えたダメージと同じだけ回復
		フルパワー,
		底力,
		フルHP特攻,
		HP半分以上特攻,
		HP半分以下特攻,
		低HP特攻,
		処刑,
		マーク追撃,
		出血追撃,
		毒追撃,
		COUNT
	};

	//レベル補正種
	enum class ASkillLvType
	{
		基礎ダメージ,
		反映率,
		命中,
		会心率,
		会心倍率,
		クールタイム,
		範囲,
		Hit数,
		追加効果,
		バフ固定値,
		バフ反映率,
		バフ発動率,
		バフ持続,
	};

	//◆Pスキル
	enum class PSkillTime
	{
		常時,//探索開始時や編成変更時のみ処理
		戦闘開始時,
		スキル使用時,
	};

	//条件
	enum class PSkillIf
	{
		条件無し,	
		HP一定以上,//状況条件
		HP一定以下,
		敵の数が一定以下,
		敵の数が一定以上,
		自身が状態異常,
		自身が隠密,
		自身が挑発,
		前列,
		後列
	};

	enum class PSkillTarget
	{
		自分,
		味方全員,
		スキル対象,
		その他
	};

	enum class PSkillEffectType
	{
		なし,
		＠スキル強化,//●アクティブスキル、通常攻撃強化
		スキル威力増減,
		スキル命中増減,
		隊列無視,
		必中,
		マーク無視,
		防御貫通,//1で完全無視
		回避貫通,
		バフ固定値,
		バフ反映率,
		バフ持続,
		デバフ固定値,
		デバフ反映率,
		デバフ持続,
		回復超過シールド,
		CT獲得,//1で戦闘開始時100%
		シールド獲得,
		吸収,//1で与えたダメージと同じだけ回復
		処刑,
		出血追撃,
		毒追撃,
		異常追撃,
		挑発追撃,
		フルHP特攻,
		HP半分以下特攻,
		HP半分以上特攻,
		＠保持効果,//●バフ、特殊ステータス増加
		与ダメージバフ,
		受ダメージバフ,
		回復率増加,
		シールド獲得量増加,
		HP1で耐える,
		毒耐性,
		出血耐性,
		毒出血耐性,
		//●非戦闘系
		未探索発見率増加,
		戦闘後回復,
		剥取増加,
		レア剥取増加,
		採取増加,
		レア採取増加,
		魔物部屋率減少,
		魔物部屋率上昇,
		素材部屋率上昇,
		財宝部屋増加,
		財宝レア度増加,
		移動速度上昇,
		//●その他
		HP増加,
		パワー増加,
		防御増加,
		命中増加,
		回避増加,
		HP割合増加,
		パワー割合増加,
		経験値増加,
		＠キーパッシブ,
		スレイヤーA,
		スレイヤーB,
		ガーディアンA,
		ガーディアンB,
		デッドアイA,
		デッドアイB,
		エレメンタリストA,
		エレメンタリストB,
		クレリックA,
		クレリックB,
		オカルティストA,
		オカルティストB,
		グラディエーターA,
		グラディエーターB,
		アサシンA,
		アサシンB,
		バーサーカーA,
		バーサーカーB,
		トリックスターA,
		トリックスターB,
		シャーマンA,
		シャーマンB,
		パスファインダーA,
		パスファインダーB,
	};
	
	enum class PSkillLvType
	{
		条件値,
		持続時間,
		発動率,
		効果値1,
		効果値2
	};

	//◆画像、音声の管理用
	//ユニット//削除予定
	enum class UnitImageType
	{
		ゴブリン,
		青ゴブリン,
		犬,
		青犬,
		白猫,
		黒猫,
		兵士,
		赤兵士,
		青兵士,
		メイド,
		ハゲ,
		執事,
		王,
		青王,
		王妃,
		青王妃,
		赤王妃,
		小王子,
		小姫,
		王子,
		姫,
		ドワーフ,
		子ドワーフ,
		茶女性,
		青女性,
		金女性,
		緑女性,
		茶村人,
		金村人,
		金子供,
		三つ編み,
		少年,
		少女,
		緑防止,
		おっさん,
		半裸,
		青オーク,
		赤オーク,
		おばさん,
		おばあさん,
		おじいさん,
		勇者,
		闘士,
		弓士,
		剣聖,
		武術家,
		魔女,
		精霊,
		くの一,
		盗賊,
		レンジャー,
		妖術師,
		大魔導師,
		族長,
		空手家,
		戦士,
		戦士2,
		重装,
		柔術家,
		呪術師,
		暗殺者,
		傭兵,
		老兵,
		戦士3,
		騎士,
		司祭,
		スライム,
		赤スライム,
		狼,
		青狼,
		三頭犬,
		スケルトン,
		サハギン,
		トレント,
		グリフィン,
		ドラゴン,
		インプ,
		COUNT
	};

	//UIアイコン
	enum class IconType
	{
		//UI汎用
		閉じる,
		資金,
		三角,
		製造力,
		完了,
		ランク,
		ゴミ箱,
		//各種ウィンドウアイコン
		装備,
		製造,
		迷宮,
		編成,
		求人,
		戦略,
		素材,
		依頼,
		情報,
		ログ,

		全て,
		ボス,
		地図,
		宝箱,
		更新,

		再募集,

		メインクエ,
		サブクエ,
		名声,

		集客,
		開発,
		撤退,

		解像度,
		BGM,
		効果音,

		New,

		//素材
		木材,
		皮材,
		鉄材,
		骨材,

		//ダンジョン
		城,
		森,
		洞窟,
		砂漠,
		山,
		滝,
		塔,
		廃墟,

		//探索用
		探索_伐採,
		探索_採掘,
		探索_採石,
		探索_財宝,
		探索_地図,
		探索_石版,

		//上部分バー
		日付,
		時間,
		人口,
		ヘルプ,
		停止,
		速度,
		設定,
		終了,

		COUNT
	};

	//アクティブ&パッシブスキル種アイコン用
	enum class SkillType
	{
		なし,
		攻撃,
		回復,
		シールド,
		補助,
		異常,
		バフ,
		デバフ,
		自分,
		単体,
		範囲,
		全体,
		乱打,
		多段,
		暗殺,
		出血,
		毒,
		スタン,
		COUNT
	};

	//効果音
	enum class SEType
	{
		//UI効果音
		決定,
		キャンセル,
		ボタン押,
		タブ押,
		掴む,
		装着,
		投資,
		//内政効果音
		クエスト完了,
		製造,
		新製造,
		販売,
		内政Lv,


		//戦闘探索効果音
		地図発見,
		ボス発見,
		探索開始,
		探索終了,

		攻撃,
		回復,
		補助,

		味方気絶,
		敵気絶,
		全滅,

		COUNT
	};

	//BGM
	enum class BGMType
	{
		準備中,
		探検中,
		通常ボス,
		エリアボス,
		タイトル,
		COUNT
	};

	//◆系統定義用
	enum class WindowType
	{
		//常時ウィンドウ
		Dungeon,
		EventLog,
		Item,
		Management,
		Material,
		Party,
		Quest,
		//ポップアップウィンドウ
		Recruit,
		Skilltree,
		Config,
		Newgame,
		Continue,
		Credit,
		Title,
		Help,
		Popup,
		Delete,
		ResetSkill,
		COUNT
	};

	enum class CraftType
	{
		木材,
		鉄材,
		革材,
		魔材,
		COUNT
	};

	//アイテム系統
	enum class ItemType
	{
		//武器
		大剣,
		盾,
		弓,
		本,
		聖杖,
		人形,
		突剣,
		刀,
		斧,
		邪杖,
		御札,
		短剣,

		//防具
		鎧,//防御
		帷子,//回避
		ローブ,//命中
		法衣,//Int

		アクセサリー,
		すべて,
		COUNT
	};

	//◆依頼系統
	enum class QuestType
	{
		階層到達,//合計素材収集が一定数以上
		固定FOE討伐,//特定FOEの討伐
		COUNT
	};

	//◆探索関係
	//部屋種
	enum class RoomType
	{
		ザコ,//雑魚5体
		素材,//伐採、採掘、掘削
		財宝,//雑魚6体 + 宝
		ボス,
		階段,
		COUNT
	};

	//探検中の状態
	enum class ExplorType
	{
		編成中,
		戦闘中,
		移動中,
		収集中,
		撤退中,
		全滅中,
		リザルト中,
		階段発見中,
		COUNT
		//宝箱開封、地図発見、戦闘後ドロップ、ボス演出などは未実装
	};

	//◆戦闘関係
	//基本ダメージ属性
	enum DamageType
	{
		物理 = 0,
		魔法 = 1,
		無属性 = 2,
		回復 = 3,
		補助 = 4
	};

	enum FormationType
	{
		前列 = 0,
		後列 = 1,
		全列 = 2
	};

	enum class StatusType
	{
		HP,
		パワー,
		防御,
		命中,
		回避,
		COUNT
	};

	//◆data配列index用変数の型◆
	using ID_Job = unsigned int;
	using ID_Item = unsigned int;
	using ID_Monster = unsigned int;
	using ID_Material = unsigned int;
	using ID_Tactics = unsigned int;
	using ID_ASkill = unsigned int;
	using ID_PSkill = unsigned int;
	using ID_Dungeon = unsigned int;
}
