//Copyright © 2019 (´･@･)
//[License]GNU Affero General Public License, version 3
//[Contact]http://tacoika.blog87.fc2.com/
#pragma once
;
namespace SDX_ADE
{
	using namespace SDX;

	//難易度
	enum class GameType
	{
		ノーマル,
		ハード,
		デスマーチ,
		COUNT
	};

	//◆Aスキル
	//スキル対象
	enum class ASkillTarget
	{
		自分,
		隣接,
		前列,
		後列,
		弱者,
		前列範囲,
		後列範囲,
		敵前列,
		敵後列,
		敵弱者,
		敵前列範囲,
		敵後列範囲,
		COUNT
	};

	//スキルタグ
	enum class ASkillType
	{
		//基本タグ
		攻撃,
		回復,
		バフ,
		デバフ,
		//範囲
		単体,
		範囲,
		暗殺,

		物理,
		魔法,

		斬撃,
		打撃,
		射撃,
		火炎,
		氷雪,
		雷撃,
		//参照ステータス
		STR,
		INT,
		DEX,
		指定なし,
		COUNT
	};

	//バフ・デバフ・特殊状態効果
	enum class BuffType
	{
		なし,
		＠バフ・デバフ,
		与ダメ増減,//割合増減
		被ダメ軽減,//割合増減
		物防,//+数値
		魔防,//+数値
		Str,//+数値
		Dex,//+数値
		Int,//+数値
		命中,//+数値
		回避,//+数値
		挑発,//ターゲットになる
		隠密,//ターゲットから外れる
		速度,//CT速度割合増減
		かばわれ,//数値の隊列の味方にかばわれる、一回かばうと残り時間０
		異常バリア,//状態異常を無効化する、一回無効化すると残り時間０
		両方バリア,//物理/魔法両方に対するバリア
		物理バリア,//物理ダメージを数値分吸収
		魔法バリア,//魔法ダメージを数値分吸収
		再生,//時間経過で回復
		祝福,//回復効果低減 or 増加
		復活,//気絶しても回復する
		分身,//スキルのHit数が増加、攻撃を受けると回避して分身消滅

		//デメリットのみのやつ
		＠状態異常,
		出血,//行動時ダメージ
		猛毒,//一定時間毎にダメージ
		スタン,//一定値CTが減少
		麻痺,//物理スキルの速度低下、回避減少？
		沈黙,//魔法スキルの速度低下
		暗闇,//物理スキルの命中低下、回避減少
		混乱,//攻撃対象が敵味方ランダムに
		石化,//行動不能、回復が遅い、回避０
		睡眠,//行動不能、ダメージで回復、回避０
		呪い,//与えたダメージが自分に跳ね返ってくる
		宣告,//時間経過で気絶
		COUNT
	};

	//追加効果
	enum class ASkillSubType
	{
		//実質bool値
		なし,
		必中,
		隠れる無視,
		挑発無視,
		異常回復,
		気絶回復,

		//エディタ上は-100～100の整数、ゲーム上は-1.0～1.0のdouble
		防御貫通,//1で完全無視
		回避貫通,
		超過回復,//最大HPを超えた分バリアを貼る
		ダメージ幅,//1で0～2.0倍
		バフ延長,//-1で解除、1で持続倍増
		デバフ延長,//-1で解除、1で持続倍増
		バフ強化,//-0.5で半減、1で倍増
		デバフ強化,//-0.5で半減、1で倍増
		先制,//1で戦闘開始時100%
		吸収,//1で与えたダメージと同じだけ回復
		コスト,//1で残りHPの100%消費
		全力,//自分のHPが100%なら威力増加
		窮地,//自分のHPが30%以下なら威力が増加
		処刑,
		挑発追撃,
		異常追撃,
		反撃,//削除予定
		COUNT
	};

	//レベル補正種
	enum class ASkillLvType
	{
		基礎ダメージ,
		反映率,
		命中,
		会心率,
		会心倍率,
		クールタイム,
		範囲,
		Hit数,
		追加効果,
		バフ固定値,
		バフ反映率,
		バフ発動率,
		バフ持続,
	};

	//◆Pスキル
	enum class PSkillTime
	{
		常時,//探索開始時や編成変更時のみ処理
		戦闘開始時,
		スキル使用時,
		スキル受ける前,
		//トリガー系パッシブ
		攻撃を受けた時,
		回復を受けた時,
		回避した時,
		自分が気絶した時,
		味方が気絶した時,
		自分が撃破した時,
		味方が撃破した時,//自分も含む
	};

	//条件
	enum class PSkillIf
	{
		条件無し,
		//状況条件
		HP一定以上,
		HP一定以下,
		敵の数が一定以下,
		敵の数が一定以上,
		自身が状態異常,
		自身が隠密,
		自身が挑発,
		前列,
		後列
	};

	enum class PSkillTarget
	{
		自分,
		味方全員,
		スキル対象,
		敵単体,//敵対象パッシブは戦闘開始時とリアクション系のみ
		敵全体,
		その他
	};

	enum class PSkillEffect
	{
		なし,
		//●アクティブスキル、通常攻撃強化
		＠スキル強化,
		ダメージ増加,
		スキル威力増減,
		スキル効果増減,
		スキルCT増減,
		アクティブスキル発動,
		物理化,
		魔法化,
		隊列無視,
		必中,
		隠れる無視,
		挑発無視,
		異常回復,
		気絶回復,
		防御貫通,//1で完全無視
		魔防貫通,
		回避貫通,
		超過回復,//最大HPを超えた分バリアを貼る
		バフ固定値,
		バフ反映率,
		バフ発動率,
		バフ持続,
		バフ延長,
		デバフ延長,
		バフ強化,//-1で解除、1で効果倍増
		デバフ強化,//-1で解除、1で効果倍増
		先制,//1で戦闘開始時100%
		むらっけ,
		吸収,//1で与えたダメージと同じだけ回復
		処刑,
		異常追撃,
		挑発追撃,
		//●バフ、特殊ステータス増加
		＠保持効果,
		与ダメージバフ,
		受ダメージバフ,
		HP1で耐える,
		異常無効,
		デバフ無効,
		身代わり,
		CT減少,
		HP回復,
		未探索発見率増加,
		戦闘後回復,
		剥取増加,
		レア剥取増加,
		採取増加,
		レア採取増加,
		魔物部屋率上昇,
		素材部屋率上昇,
		移動速度上昇,
		//●その他
		HP増加,
		STR増加,
		INT増加,
		DEX増加,
		物防増加,
		魔防増加,
		命中増加,
		回避増加,
		HP割合増加,
		STR割合増加,
		INT割合増加,
		DEX割合増加,
		物防割合増加,
		魔防割合増加,
		経験値増加,
		＠キーパッシブ,
	};
	
	enum class PSkillLvType
	{
		条件値,
		持続時間,
		発動率,
		効果値1,
		効果値2
	};

	//◆画像、音声の管理用
	//ユニット//削除予定
	enum class UnitImageType
	{
		ゴブリン,
		青ゴブリン,
		犬,
		青犬,
		白猫,
		黒猫,
		兵士,
		赤兵士,
		青兵士,
		メイド,
		ハゲ,
		執事,
		王,
		青王,
		王妃,
		青王妃,
		赤王妃,
		小王子,
		小姫,
		王子,
		姫,
		ドワーフ,
		子ドワーフ,
		茶女性,
		青女性,
		金女性,
		緑女性,
		茶村人,
		金村人,
		金子供,
		三つ編み,
		少年,
		少女,
		緑防止,
		おっさん,
		半裸,
		青オーク,
		赤オーク,
		おばさん,
		おばあさん,
		おじいさん,
		勇者,
		闘士,
		弓士,
		剣聖,
		武術家,
		魔女,
		精霊,
		くの一,
		盗賊,
		レンジャー,
		妖術師,
		大魔導師,
		族長,
		空手家,
		戦士,
		戦士2,
		重装,
		柔術家,
		呪術師,
		暗殺者,
		傭兵,
		老兵,
		戦士3,
		騎士,
		司祭,
		スライム,
		赤スライム,
		狼,
		青狼,
		三頭犬,
		スケルトン,
		サハギン,
		トレント,
		グリフィン,
		ドラゴン,
		インプ,
		COUNT
	};

	//UIアイコン
	enum class IconType
	{
		//UI汎用
		閉じる,
		資金,
		三角,
		製造力,
		完了,
		ランク,
		ゴミ箱,
		//各種ウィンドウアイコン
		装備,
		製造,
		迷宮,
		編成,
		求人,
		戦略,
		素材,
		依頼,
		情報,
		ログ,

		全て,
		ボス,
		地図,
		宝箱,
		更新,

		再募集,

		メインクエ,
		サブクエ,
		名声,

		集客,
		開発,
		撤退,

		解像度,
		BGM,
		効果音,

		New,

		//素材
		木材,
		皮材,
		鉄材,
		骨材,

		//ダンジョン
		城,
		森,
		洞窟,
		砂漠,
		山,
		滝,
		塔,
		廃墟,

		//探索用
		探索_伐採,
		探索_採掘,
		探索_財宝,
		探索_地図,
		探索_石版,

		//上部分バー
		日付,
		時間,
		人口,
		ヘルプ,
		停止,
		速度,
		設定,
		終了,

		COUNT
	};

	//アクティブ&パッシブスキル種
	enum class SkillType
	{
		なし,
		攻撃,
		回復,
		補助,
		異常,
		バフ,
		デバフ,
		自分,
		単体,
		範囲,
		全体,
		多段,
		暗殺,
		物理,
		魔法,
		無属性,
		斬撃,
		打撃,
		射撃,
		火炎,
		氷雪,
		雷撃,
		力,
		技,
		魔,
		COUNT
	};

	//効果音
	enum class SEType
	{
		//UI効果音
		決定,
		キャンセル,
		ボタン押,
		タブ押,
		掴む,
		装着,
		投資,
		//内政効果音
		クエスト完了,
		製造,
		新製造,
		販売,
		内政Lv,


		//戦闘探索効果音
		地図発見,
		ボス発見,
		探索開始,
		探索終了,

		攻撃,
		回復,
		補助,

		味方気絶,
		敵気絶,
		全滅,

		COUNT
	};

	//BGM
	enum class BGMType
	{
		準備中,
		探検中,
		通常ボス,
		エリアボス,
		タイトル,
		COUNT
	};

	//◆系統定義用
	enum class WindowType
	{
		//常時ウィンドウ
		Dungeon,
		EventLog,
		Item,
		Management,
		Material,
		Party,
		Quest,
		//ポップアップウィンドウ
		Recruit,
		Skilltree,
		Config,
		Newgame,
		Continue,
		Credit,
		Title,
		Help,
		Popup,
		Delete,
		ResetSkill,
		COUNT
	};

	enum class CraftType
	{
		木材,
		鉄材,
		石材,
		革材,
		骨材,
		魔材,
		COUNT
	};

	//アイテム系統
	enum class ItemType
	{
		//武器
		大剣,
		剣盾,
		大盾,
		円盤,
		斧,
		刀,
		弓,
		神杖,
		錫杖,
		導杖,
		書物,
		水晶,

		//防具
		重鎧,//防御
		軽鎧,//回避
		軽装,//命中
		外套,//Int

		アクセサリー,
		すべて,
		COUNT
	};

	//◆依頼系統
	enum class QuestType
	{
		素材調査,//合計素材収集が一定数以上
		街ランク上昇,
		魔物討伐,//何でもいいからモンスターを一定数退治
		ダンジョン発見,//特定階層に到達
		累計FOE討伐,//FOE一定数討伐
		財宝収集,//財宝一定数収集
		固定FOE討伐,//特定FOEの討伐
		COUNT
	};

	//◆探索関係
	//部屋種
	enum class RoomType
	{
		ザコ,//雑魚5体
		素材,//伐採、採掘、掘削
		財宝,//雑魚6体 + 宝
		ボス,
		階段,
		COUNT
	};

	//探検中の状態
	enum class ExplorType
	{
		編成中,
		戦闘中,
		移動中,
		収集中,
		撤退中,
		全滅中,
		リザルト中,
		階段発見中,
		COUNT
		//宝箱開封、地図発見、戦闘後ドロップ、ボス演出などは未実装
	};

	enum class OrderType
	{
		なし,//自動なし
		ご安全に,//ボスが発生するか、全滅したら一つ下の階層へ逃げる
		最深部へ,//出来るだけ深い階層へ進む
		お宝探し,//未発見財宝がある階層を自動選択
		ボス探し,//ボス未発見階層を自動選択、ボス全部見つけてたらご安全に変更
		COUNT
	};

	//◆戦闘関係
	//基本ダメージ属性
	enum DamageType
	{
		物理 = 0,
		魔法 = 1,
		無属性 = 2,
		回復 = 3,
		補助 = 4
	};

	enum FormationType
	{
		前列 = 0,
		後列 = 1,
		全列 = 2
	};

	enum class StatusType
	{
		HP,
		力,
		技,
		知,
		物防,
		魔防,
		命中,
		回避,
		会心,
		COUNT
	};

	//◆data配列index用変数の型◆
	using ID_Job = unsigned int;
	using ID_Item = unsigned int;
	using ID_Monster = unsigned int;
	using ID_Material = unsigned int;
	using ID_Tactics = unsigned int;
	using ID_ASkill = unsigned int;
	using ID_PSkill = unsigned int;
	using ID_Dungeon = unsigned int;
}
