/*!
@page howtoiOS SDXの導入方法(iOS)
現在サポートしていませんが、ローカルで動作確認は出来ると思います。\n
\n
SDXFrameworkの利用にはSDXFrameworkが必要です。\n
開発者登録していないため、シミュレータ上での動かし方のみ解説します\n
とりあえず1からプロジェクトを設定する方法がややこしいので、サンプルプロジェクトを改造しています\n
<HR>
<B>1 Xcodeをインストールする</B>\n
AppStoreからXcodeの最新版をダウンロードしてインストールします。 \n
<HR>
<B>2 サンプルの実行</B>\n
SDXFrameworkフォルダのXcode-iOS/SampleのSDX.xcodeprojを開きます\n
ビルドして実行するとシミュレータ上でサンプルが動きます\n
<HR>
<B>3 配布方法やアプリケーション名の変更</B>\n
Apple社のライセンスとGPLの条項が衝突する関係でAppStoreで配布する事は困難です\n
\n
Cydiaで配布するのは問題ありませんが、ユーザーのiOS端末のサポートが切れる可能性があり、\n
iPhoneの脱獄は米国でも日本でも合法だけど、iPadの脱獄は米国だと非合法、日本だと合法だったりするので\n
自己責任でお願いします。\n
\n
色々調査中\n
*/